---
kind: property
id: P:Autodesk.Revit.DB.Connector.AllRefs
zh: 连接件、接口
source: html/bfd0a83e-c6a4-cec6-8428-b5b8b4357ee5.htm
---
# Autodesk.Revit.DB.Connector.AllRefs Property

**中文**: 连接件、接口

All references of the connector.

## Syntax (C#)
```csharp
public ConnectorSet AllRefs { get; }
```

## Remarks
A set of connectors that the connectors is connected to, including both physical connection and logical connection.